/* ---------------------------------------------------------------------------------------------- 
 * 
 * プログラム概要 ： JavaScriptイベントリスナー動作テスト
 * バージョン     ： 1.0.0.0(新規作成)
 * 処理概要       ： JavaScriptイベントリスナー動作テスト
 * 新規作成日     ： 2026/06/21 09:24:30
 * 最終更新日     ： 2026/06/21 09:24:30
 * 
 * Copyright (c) 2026 Techmilestone, All rights reserved.
 * 
 * ---------------------------------------------------------------------------------------------- */

/* ---------------------------------------------------------------------------------------------- */
// 変数定義
/* ---------------------------------------------------------------------------------------------- */

let canvas        = null;        // キャンバス
let ctx           = null;        // コンテキスト
let pos           = {x:0, y:0};  // キャンバスのマウス座標
let string        = '';          // キャンバスの表示文字列
let is_mouse_down = false;       // マウス押下の有無
let push_count    = 0;           // マウス押下数

/* ---------------------------------------------------------------------------------------------- */
// キャンバス表示
/* ---------------------------------------------------------------------------------------------- */
function drawCanvas(){

	// キャンバス背景設定
	ctx.fillStyle = "#E0FFFF";
	ctx.fillRect(0, 0, canvas.width, canvas.height);

	// マウスステータスの文字列に設定
	const mouseDownString = is_mouse_down ? "Mouse ON" : "Mouse OFF";

	// 共通定義
	ctx.fillStyle = "#000000";                     // 文字の色
	ctx.font  = "12px MS Gothic";                  // フォントサイズ

	// 表示する文字列を設定(ヘッダー)
	string = 'ステータス'
	ctx.fillText(string, 10, canvas.height-12*3);

	// 表示する文字列を設定(マウス位置)
    string = 'x:' + `${pos.x}`.padStart(3) + ' ' + 'y:' + `${pos.y}`.padStart(3) + ' ' + `${mouseDownString}`;
	ctx.fillText(string, 10, canvas.height-12*2);

	// 表示する文字列を設定(マウス押下数)
	string = 'マウス押下数:' + `${push_count}`.padStart(3);
	ctx.fillText(string, 10, canvas.height-12);

}

/* ---------------------------------------------------------------------------------------------- */
// マウスイベント読み込み
/* ---------------------------------------------------------------------------------------------- */
function mouseMoveListener(e){

	// オフセット位置の指定
	const rect = e.target.getBoundingClientRect();

	// キャンバス位置の指定
	pos.x = e.clientX - rect.left;
	pos.y = e.clientY - rect.top;

	// キャンバス表示
	drawCanvas();

};


/* ---------------------------------------------------------------------------------------------- */
// マウスボタンを押した時の処理
/* ---------------------------------------------------------------------------------------------- */
function mouseDownListener(){

	// マウスステータスの有効化
	is_mouse_down = true;

	// マウス押下数の加算
	push_count = push_count + 1;

	// キャンバス表示
	drawCanvas();

};

/* ---------------------------------------------------------------------------------------------- */
// マウスボタンを離した時の処理
/* ---------------------------------------------------------------------------------------------- */
function mouseUpListener(){

	// マウスステータスの無効化
	is_mouse_down = false;

	// マウス情報を表示
	drawCanvas();

};

/* ---------------------------------------------------------------------------------------------- */
// イベントリスナーの初期化
/* ---------------------------------------------------------------------------------------------- */
window.addEventListener("load", function(){

	// キャンバスの初期化
	canvas = document.getElementById("canvas");

	// キャンバスコンテキストの初期化
    if (canvas.getContext) {
		ctx = canvas.getContext("2d");
	}

	// マウスイベント設定
	canvas.addEventListener("mousemove", mouseMoveListener, false);
	canvas.addEventListener("mousedown", mouseDownListener, false);
	canvas.addEventListener("mouseup",   mouseUpListener,   false);

	// キャンバス表示
	drawCanvas();

});

/* ---------------------------------------------------------------------------------------------- */
// 処理ここまで
/* ---------------------------------------------------------------------------------------------- */
