/* ---------------------------------------------------------------------------------------------- 
 * 
 * プログラム概要 ： Canvasテスト
 * バージョン     ： 0.0.0.1(初期作成)
 * 処理概要       ： メイン処理
 * 新規作成日     ： 2026/05/01 15:39:44
 * 最終更新日     ： 2026/05/01 15:39:44
 * 
 * Copyright (c) 2026 Techmilestone, All rights reserved.
 * 
 * ---------------------------------------------------------------------------------------------- */

/* ---------------------------------------------------------------------------------------------- */
// 初期設定
/* ---------------------------------------------------------------------------------------------- */

let canvas      = null;        // キャンバス
let context     = null;        // コンテキスト
let pos         = {x:0, y:0};  // キャンバス上のマウス座標
let string      = '';          // キャンバスの表示文字列
let isMouseDown = false;       // マウス押下の有無

/* ---------------------------------------------------------------------------------------------- */
// マウスイベント読み込み
/* ---------------------------------------------------------------------------------------------- */
const mouseMoveListener = (e) => {

	// オフセット位置
	const rect = e.target.getBoundingClientRect();

	// キャンバス位置
	pos.x = e.clientX - rect.left;
	pos.y = e.clientY - rect.top;

	// マウス情報を表示
	drawCanvas();

};


/* ---------------------------------------------------------------------------------------------- */
// マウスボタンを押した時の処理
/* ---------------------------------------------------------------------------------------------- */
const mouseDownListener = () => {

	// マウスステータスの有効化
	isMouseDown = true;

	// マウス情報を表示
	drawCanvas();

};

/* ---------------------------------------------------------------------------------------------- */
// マウスボタンを離した時の処理
/* ---------------------------------------------------------------------------------------------- */
const mouseUpListener = () => {

	// マウスステータスの無効化
	isMouseDown = false;

	// マウス情報を表示
	drawCanvas();

};

/* ---------------------------------------------------------------------------------------------- */
// キャンバス表示
/* ---------------------------------------------------------------------------------------------- */

const drawCanvas = () => {

	// キャンバス背景設定
	context.fillStyle = "green";
	context.fillRect(0, 0, canvas.width, canvas.height);

	// マウスステータスの文字列に設定
	const mouseDownString = isMouseDown ? "Mouse ON" : "Mouse OFF";

	// 共通定義
	context.fillStyle = "#FFFFFF";                      // 文字の色

	// 表示する文字列を設定
	context.font  = "14px MS Gothic";
	context.fillText('ステータス', 150, canvas.height/2);

	// 表示する文字列を設定
	string = `x: ${pos.x} y:${pos.y} ${mouseDownString}`;
	context.font = "12px MS Gothic";
	context.fillText(string, 150, canvas.height/2+12);  // 文字列の定義

}

/* ---------------------------------------------------------------------------------------------- */
// イベントリスナーの初期化
/* ---------------------------------------------------------------------------------------------- */
window.addEventListener("load", () => {

	// キャンバスの初期化
	canvas = document.getElementById("canvas");

	// キャンバスコンテキストを初期化
    if (canvas.getContext) {
		context = canvas.getContext("2d");  
	}

	// マウス情報を表示
	drawCanvas();

	// マウスイベント設定
	canvas.addEventListener("mousemove", mouseMoveListener, false);
	canvas.addEventListener("mousedown", mouseDownListener, false);
	canvas.addEventListener("mouseup", mouseUpListener, false);

});

/* ---------------------------------------------------------------------------------------------- */
// 処理ここまで
/* ---------------------------------------------------------------------------------------------- */
