/* ---------------------------------------------------------------------------------------------- 
 * 
 * プログラム概要 ： Canvasテスト(ナンバープレースアプリ作成)
 * バージョン     ： 0.0.0.1(初期作成)
 * 処理概要       ： メイン処理
 * 新規作成日     ： 2026/05/01 15:39:44
 * 最終更新日     ： 2026/05/01 15:39:44
 * 
 * Copyright (c) 2026 Techmilestone, All rights reserved.
 * 
 * ---------------------------------------------------------------------------------------------- */

/* ---------------------------------------------------------------------------------------------- */
// 初期設定
/* ---------------------------------------------------------------------------------------------- */

let canvas      = null;        // キャンバス
let context     = null;        // コンテキスト
let pos         = {x:0, y:0};  // キャンバス上のマウス座標
let string      = '';          // キャンバスの表示文字列
let isMouseDown = false;       // マウス押下の有無
let push_count  = 0;           // プッシュカウント

/* ---------------------------------------------------------------------------------------------- */
// マウスイベント読み込み
/* ---------------------------------------------------------------------------------------------- */
const mouseMoveListener = (e) => {

	// オフセット位置
	const rect = e.target.getBoundingClientRect();

	// キャンバス位置
	pos.x = e.clientX - rect.left;
	pos.y = e.clientY - rect.top;

	// マウス情報を表示
	drawCanvas();

};


/* ---------------------------------------------------------------------------------------------- */
// マウスボタンを押した時の処理
/* ---------------------------------------------------------------------------------------------- */
const mouseDownListener = () => {

	// マウスステータスの有効化
	isMouseDown = true;

	// プッシュカウント
	push_count = push_count + 1;

	// マウス情報を表示
	drawCanvas();

};

/* ---------------------------------------------------------------------------------------------- */
// マウスボタンを離した時の処理
/* ---------------------------------------------------------------------------------------------- */
const mouseUpListener = () => {

	// マウスステータスの無効化
	isMouseDown = false;

	// マウス情報を表示
	drawCanvas();

};

/* ---------------------------------------------------------------------------------------------- */
// キャンバス表示
/* ---------------------------------------------------------------------------------------------- */

const drawCanvas = () => {

	// キャンバス背景設定
	context.fillStyle = "#FFFFFF";
	context.fillRect(0, 0, canvas.width, canvas.height);

	// マウスステータスの文字列に設定
	const mouseDownString = isMouseDown ? "Mouse ON" : "Mouse OFF";

	// 共通定義
	context.fillStyle = "#000000";                      // 文字の色

	// 表示する文字列を設定(メモ数字)
	context.font = "12px MS Gothic";
	for(let i = 0; i < 30; i++) {
		string = `${(i+1)%10}`;
		context.fillText(string,  0, (i+1)*12);  // 文字列の定義
		context.fillText(string,  6, (i+1)*12);  // 文字列の定義
		context.fillText(string, 12, (i+1)*12);  // 文字列の定義
	}

	// 表示する文字列を設定(ナンプレ設定数字)
	context.font = "24px MS Gothic";
	string = "1"
	context.fillText(string, 50, 24);  // 文字列の定義

	// 表示する文字列を設定(マウス位置)
	context.font = "12px MS Gothic";
	string = `x: ${pos.x} y:${pos.y} ${mouseDownString}`;
	context.fillText(string, 150, canvas.height/2+12);  // 文字列の定義

	// 表示する文字列を設定(プッシュカウント)
	context.font = "12px MS Gothic";
	string = `プッシュカウント: ${push_count}`;
	context.fillText(string, 150, canvas.height/2);  // 文字列の定義

}

/* ---------------------------------------------------------------------------------------------- */
// イベントリスナーの初期化
/* ---------------------------------------------------------------------------------------------- */
window.addEventListener("load", () => {

	// キャンバスの初期化
	canvas = document.getElementById("canvas");

	// キャンバスコンテキストを初期化
    if (canvas.getContext) {
		context = canvas.getContext("2d");  
	}

	// マウス情報を表示
	drawCanvas();

	// マウスイベント設定
	canvas.addEventListener("mousemove", mouseMoveListener, false);
	canvas.addEventListener("mousedown", mouseDownListener, false);
	canvas.addEventListener("mouseup", mouseUpListener, false);

});

/* ---------------------------------------------------------------------------------------------- */
// 処理ここまで
/* ---------------------------------------------------------------------------------------------- */
